html/20231128T145249--consult-package-benefits__emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>consult package benefits</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">14 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231128T145249--consult-package-benefits__emacs.html">consult package benefits</a></h1>
<p>
Tu juokauji gal. Koks amazing package.. :) Apie ji suzinojau tik 2023.12.
</p>

<p>
Bemegindamas irasti denote radau sita package.
</p>

<p>
Cia intro video -
<a href="https://www.youtube.com/watch?v=HwBHBwYgs2g&amp;ab_channel=EmacsElements">https://www.youtube.com/watch?v=HwBHBwYgs2g&amp;ab_channel=EmacsElements</a>
</p>

<ul class="org-ul">
<li>Galiu paturbinti C-x b, kad rodytu man buffer contenta. Nice.</li>
<li><code>consult-grep</code> - find whateveryouwant in a current PROJECT(git project).</li>
<li><code>consul-man</code> - look for ANYTHING in LINUX MANUAL PAGE. WTF.</li>
<li><code>consult-info</code> - find ANYTHING in your installed packages manuals&#x2026;</li>
<li><code>consult-bookmark</code> - set a bookmark in a location and then easily jump to it
later&#x2026; almost like my org find agenda file.</li>
<li><code>consult-theme</code> - change and try themes on the fly. wtf.</li>
<li><code>consult-flymake</code>???????????????????? Labadiena</li>
<li><code>consult-goto-line</code> - cool</li>
<li><code>consult-outline/consult-org-headings</code> - look through ORG file outlines.
Through all the headings. Thats cool when in a large document! That's like a
table of contents for you.</li>
<li><code>consult-org-agenda</code>??? must try that out</li>
<li><code>consult-project-buffer</code> - look only through opened files in the project.</li>
<li><code>M-s</code> is a big one!</li>
<li><code>M-s e</code> for example shows you all the search functions you previously typed
for. Nice.</li>
<li><code>M-g i</code> - look for functions inside the file!!!</li>
<li><code>C-u M-s g</code> - first specify the directory and then do the search. Great,
works like regular RG.</li>
</ul>

<p>
bookmarks is another cool thing.. can set them and then later jump to them with
c-x b and pressing m then SPACE and you will have a list of bookmarks!!
</p>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-emacs.html">emacs</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
